johnnyclem/neon-link/sdkconfig.defaults.p4devkit
# Waveshare ESP32-P4-Module-DEV-KIT overlay — use with:
#   idf.py set-target esp32p4
#   idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.p4devkit" build
#
# The P4 has no on-chip WiFi/BLE. Radio is the module's ESP32-C6 over
# SDIO (ESP-Hosted + wifi_remote). Ethernet EMAC is onboard but not
# hooked yet. OLED is on the I2C header (SDA=GPIO7, SCL=GPIO8).

CONFIG_IDF_TARGET="esp32p4"
CONFIG_NEON_BOARD_P4DEVKIT=y
# CONFIG_NEON_BOARD_CUSTOM is not set
# CONFIG_NEON_BOARD_AMYBOARD is not set

# Engineering-sample silicon on this kit is rev v1.3.
CONFIG_ESP32P4_REV_MIN_1=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"

CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_16mb.csv"

# 32 MB HEX PSRAM in the module package. 20 MHz is the non-experimental
# rate on IDF 5.3.2; plenty for the UI + pulse engine.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_20M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Type-C on this kit is a USB-UART bridge on the P4 default pins
# (GPIO 37/38). Native USB Serial/JTAG is a different PHY and is silent
# on this port — that is why a USB-JTAG image only printed the ROM stub.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set

# C6 coprocessor via espressif/esp_wifi_remote + esp_hosted.
# ESP_HOST_WIFI_ENABLED is the IDF built-in host-WiFi switch and it
# *disables* wifi_remote — leave it off. Slave defaults to C6 on P4.
# CONFIG_ESP_HOST_WIFI_ENABLED is not set
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
# wifi_remote's WIFI_INIT_CONFIG_DEFAULT() needs this when SPIRAM is on;
# the Kconfig `depends on SPIRAM` does not always fire on first configure.
CONFIG_WIFI_RMT_CACHE_TX_BUFFER_NUM=32
# CONFIG_BT_ENABLED is not set
# CONFIG_BT_NIMBLE_ENABLED is not set
# CONFIG_ESP_COEX_SW_COEXIST_ENABLE is not set

# Same ES8311 / NS4150B 3.5 mm jack as the v3.1 overlay. Audio is off
# on this rev-v1.3 profile until someone turns it on for a listen test.
# CONFIG_NEON_AUDIO is not set
# CONFIG_NEON_LINK_AUDIO is not set
CONFIG_NEON_I2S_MCLK=13
CONFIG_NEON_I2S_BCLK=12
CONFIG_NEON_I2S_LRCLK=10
CONFIG_NEON_I2S_DOUT=9
CONFIG_NEON_I2S_DIN=11
